# Contains Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DistributionSysTypeSet..::..Contains Method
DistributionSysTypeSet Class See Also
---
Tests for the existence of a DistributionSys type within the set.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool Contains(
	DistributionSysType item
)
```

Visual Basic
---
```text
Public Overridable Function Contains ( _
	item As DistributionSysType _
) As Boolean
```

Visual C++
---
```text
public:
virtual bool Contains(
	DistributionSysType^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB.Electrical..::..DistributionSysTypeThe DistributionSys type to be searched for.
# ### Return Value
The Contains method returns True if the DistributionSys type is within the set, otherwise False.
# See Also
DistributionSysTypeSet Class
Autodesk.Revit.DB.Electrical Namespace